; domain
(define (domain joint_bar)
(:requirements :strips :equality :typing :adl :conditional-effects)

(:types link angle)

(:predicates
	(AngleOrd ?a - angle ?a1 - angle)
	(HasAngle ?l - angle ?j - link)
	(Affected ?l1 - link ?l2 - link)
    (IsChildOf ?l1 - link ?l2 - link)
)

(:action increase_angle
:parameters (?child_link - link ?a1 ?a2 - angle)
:precondition (and 
	(HasAngle ?a1 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a1 ?child_link)) 
	    (HasAngle ?a2 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a3 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a3 ?ls))
			        (HasAngle ?a4 ?ls)
		        )
		    )
	    )
    )
)

(:action decrease_angle
:parameters (?child_link - link ?a2 ?a1 - angle)
:precondition (and 
	(HasAngle ?a2 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a2 ?child_link)) 
	    (HasAngle ?a1 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a4 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a4 ?ls))
			        (HasAngle ?a3 ?ls)
		        )
		    )
	    )
    )
)
)

; problem
(define (problem joint_bar_3)
(:domain joint_bar)
(:objects
    link1 link2 link3 link4 - link
    angle0 angle10 angle20 angle30 angle40 angle50 angle60 angle70 angle80 angle90 angle100 angle110 angle120 angle130 angle140 angle150 angle160 angle170 angle180 angle190 angle200 angle210 angle220 angle230 angle240 angle250 angle260 angle270 angle280 angle290 angle300 angle310 angle320 angle330 angle340 angle350 - angle)
(:init
    (AngleOrd angle0 angle10)
    (AngleOrd angle10 angle20)
    (AngleOrd angle20 angle30)
    (AngleOrd angle30 angle40)
    (AngleOrd angle40 angle50)
    (AngleOrd angle50 angle60)
    (AngleOrd angle60 angle70)
    (AngleOrd angle70 angle80)
    (AngleOrd angle80 angle90)
    (AngleOrd angle90 angle100)
    (AngleOrd angle100 angle110)
    (AngleOrd angle110 angle120)
    (AngleOrd angle120 angle130)
    (AngleOrd angle130 angle140)
    (AngleOrd angle140 angle150)
    (AngleOrd angle150 angle160)
    (AngleOrd angle160 angle170)
    (AngleOrd angle170 angle180)
    (AngleOrd angle180 angle190)
    (AngleOrd angle190 angle200)
    (AngleOrd angle200 angle210)
    (AngleOrd angle210 angle220)
    (AngleOrd angle220 angle230)
    (AngleOrd angle230 angle240)
    (AngleOrd angle240 angle250)
    (AngleOrd angle250 angle260)
    (AngleOrd angle260 angle270)
    (AngleOrd angle270 angle280)
    (AngleOrd angle280 angle290)
    (AngleOrd angle290 angle300)
    (AngleOrd angle300 angle310)
    (AngleOrd angle310 angle320)
    (AngleOrd angle320 angle330)
    (AngleOrd angle330 angle340)
    (AngleOrd angle340 angle350)
    (AngleOrd angle350 angle0)

    (IsChildOf link2 link1)
    (IsChildOf link3 link2)
    (IsChildOf link4 link3)

    (Affected link2 link1)
    (Affected link3 link1)
    (Affected link3 link2)
    (Affected link4 link1)
    (Affected link4 link2)
    (Affected link4 link3)

    (HasAngle angle190 link1)
    (HasAngle angle190 link2)
    (HasAngle angle260 link3)
    (HasAngle angle110 link4)
)
(:goal
(and
    (HasAngle angle30 link1)
    (HasAngle angle10 link2)
    (HasAngle angle330 link3)
    (HasAngle angle190 link4)
    )
)
)

; plan
1. (decrease_angle link1 angle190 angle180)
   deleted: (hasangle angle190 link1) (hasangle angle190 link2) (hasangle angle260 link3) (hasangle angle110 link4)
   added: (hasangle angle180 link1) (hasangle angle180 link2) (hasangle angle250 link3) (hasangle angle100 link4)
   goals met: 0 of 4
2. (decrease_angle link1 angle180 angle170)
   deleted: (hasangle angle180 link1) (hasangle angle180 link2) (hasangle angle250 link3) (hasangle angle100 link4)
   added: (hasangle angle170 link1) (hasangle angle170 link2) (hasangle angle240 link3) (hasangle angle90 link4)
   goals met: 0 of 4
3. (decrease_angle link1 angle170 angle160)
   deleted: (hasangle angle170 link1) (hasangle angle170 link2) (hasangle angle240 link3) (hasangle angle90 link4)
   added: (hasangle angle160 link1) (hasangle angle160 link2) (hasangle angle230 link3) (hasangle angle80 link4)
   goals met: 0 of 4
4. (decrease_angle link1 angle160 angle150)
   deleted: (hasangle angle160 link1) (hasangle angle160 link2) (hasangle angle230 link3) (hasangle angle80 link4)
   added: (hasangle angle150 link1) (hasangle angle150 link2) (hasangle angle220 link3) (hasangle angle70 link4)
   goals met: 0 of 4
5. (decrease_angle link1 angle150 angle140)
   deleted: (hasangle angle150 link1) (hasangle angle150 link2) (hasangle angle220 link3) (hasangle angle70 link4)
   added: (hasangle angle140 link1) (hasangle angle140 link2) (hasangle angle210 link3) (hasangle angle60 link4)
   goals met: 0 of 4
6. (decrease_angle link1 angle140 angle130)
   deleted: (hasangle angle140 link1) (hasangle angle140 link2) (hasangle angle210 link3) (hasangle angle60 link4)
   added: (hasangle angle130 link1) (hasangle angle130 link2) (hasangle angle200 link3) (hasangle angle50 link4)
   goals met: 0 of 4
7. (decrease_angle link1 angle130 angle120)
   deleted: (hasangle angle130 link1) (hasangle angle130 link2) (hasangle angle200 link3) (hasangle angle50 link4)
   added: (hasangle angle120 link1) (hasangle angle120 link2) (hasangle angle190 link3) (hasangle angle40 link4)
   goals met: 0 of 4
8. (decrease_angle link1 angle120 angle110)
   deleted: (hasangle angle120 link1) (hasangle angle120 link2) (hasangle angle190 link3) (hasangle angle40 link4)
   added: (hasangle angle110 link1) (hasangle angle110 link2) (hasangle angle180 link3) (hasangle angle30 link4)
   goals met: 0 of 4
9. (decrease_angle link1 angle110 angle100)
   deleted: (hasangle angle110 link1) (hasangle angle110 link2) (hasangle angle180 link3) (hasangle angle30 link4)
   added: (hasangle angle100 link1) (hasangle angle100 link2) (hasangle angle170 link3) (hasangle angle20 link4)
   goals met: 0 of 4
10. (decrease_angle link1 angle100 angle90)
   deleted: (hasangle angle100 link1) (hasangle angle100 link2) (hasangle angle170 link3) (hasangle angle20 link4)
   added: (hasangle angle90 link1) (hasangle angle90 link2) (hasangle angle160 link3) (hasangle angle10 link4)
   goals met: 0 of 4
11. (decrease_angle link1 angle90 angle80)
   deleted: (hasangle angle90 link1) (hasangle angle90 link2) (hasangle angle160 link3) (hasangle angle10 link4)
   added: (hasangle angle80 link1) (hasangle angle80 link2) (hasangle angle150 link3) (hasangle angle0 link4)
   goals met: 0 of 4
12. (decrease_angle link1 angle80 angle70)
   deleted: (hasangle angle80 link1) (hasangle angle80 link2) (hasangle angle150 link3) (hasangle angle0 link4)
   added: (hasangle angle70 link1) (hasangle angle70 link2) (hasangle angle140 link3) (hasangle angle350 link4)
   goals met: 0 of 4
13. (decrease_angle link1 angle70 angle60)
   deleted: (hasangle angle70 link1) (hasangle angle70 link2) (hasangle angle140 link3) (hasangle angle350 link4)
   added: (hasangle angle60 link1) (hasangle angle60 link2) (hasangle angle130 link3) (hasangle angle340 link4)
   goals met: 0 of 4
14. (decrease_angle link1 angle60 angle50)
   deleted: (hasangle angle60 link1) (hasangle angle60 link2) (hasangle angle130 link3) (hasangle angle340 link4)
   added: (hasangle angle50 link1) (hasangle angle50 link2) (hasangle angle120 link3) (hasangle angle330 link4)
   goals met: 0 of 4
15. (decrease_angle link1 angle50 angle40)
   deleted: (hasangle angle50 link1) (hasangle angle50 link2) (hasangle angle120 link3) (hasangle angle330 link4)
   added: (hasangle angle40 link1) (hasangle angle40 link2) (hasangle angle110 link3) (hasangle angle320 link4)
   goals met: 0 of 4
16. (decrease_angle link1 angle40 angle30)
   deleted: (hasangle angle40 link1) (hasangle angle40 link2) (hasangle angle110 link3) (hasangle angle320 link4)
   added: (hasangle angle30 link1) (hasangle angle30 link2) (hasangle angle100 link3) (hasangle angle310 link4)
   goals met: 1 of 4
17. (decrease_angle link2 angle30 angle20)
   deleted: (hasangle angle30 link2) (hasangle angle100 link3) (hasangle angle310 link4)
   added: (hasangle angle20 link2) (hasangle angle90 link3) (hasangle angle300 link4)
   goals met: 1 of 4
18. (decrease_angle link2 angle20 angle10)
   deleted: (hasangle angle20 link2) (hasangle angle90 link3) (hasangle angle300 link4)
   added: (hasangle angle10 link2) (hasangle angle80 link3) (hasangle angle290 link4)
   goals met: 2 of 4
19. (decrease_angle link3 angle80 angle70)
   deleted: (hasangle angle80 link3) (hasangle angle290 link4)
   added: (hasangle angle70 link3) (hasangle angle280 link4)
   goals met: 2 of 4
20. (decrease_angle link3 angle70 angle60)
   deleted: (hasangle angle70 link3) (hasangle angle280 link4)
   added: (hasangle angle60 link3) (hasangle angle270 link4)
   goals met: 2 of 4
21. (decrease_angle link3 angle60 angle50)
   deleted: (hasangle angle60 link3) (hasangle angle270 link4)
   added: (hasangle angle50 link3) (hasangle angle260 link4)
   goals met: 2 of 4
22. (decrease_angle link3 angle50 angle40)
   deleted: (hasangle angle50 link3) (hasangle angle260 link4)
   added: (hasangle angle40 link3) (hasangle angle250 link4)
   goals met: 2 of 4
23. (decrease_angle link3 angle40 angle30)
   deleted: (hasangle angle40 link3) (hasangle angle250 link4)
   added: (hasangle angle30 link3) (hasangle angle240 link4)
   goals met: 2 of 4
24. (decrease_angle link3 angle30 angle20)
   deleted: (hasangle angle30 link3) (hasangle angle240 link4)
   added: (hasangle angle20 link3) (hasangle angle230 link4)
   goals met: 2 of 4
25. (decrease_angle link3 angle20 angle10)
   deleted: (hasangle angle20 link3) (hasangle angle230 link4)
   added: (hasangle angle10 link3) (hasangle angle220 link4)
   goals met: 2 of 4
26. (decrease_angle link3 angle10 angle0)
   deleted: (hasangle angle10 link3) (hasangle angle220 link4)
   added: (hasangle angle0 link3) (hasangle angle210 link4)
   goals met: 2 of 4
27. (decrease_angle link3 angle0 angle350)
   deleted: (hasangle angle0 link3) (hasangle angle210 link4)
   added: (hasangle angle350 link3) (hasangle angle200 link4)
   goals met: 2 of 4
28. (decrease_angle link3 angle350 angle340)
   deleted: (hasangle angle350 link3) (hasangle angle200 link4)
   added: (hasangle angle340 link3) (hasangle angle190 link4)
   goals met: 3 of 4
29. (decrease_angle link3 angle340 angle330)
   deleted: (hasangle angle340 link3) (hasangle angle190 link4)
   added: (hasangle angle330 link3) (hasangle angle180 link4)
   goals met: 3 of 4
30. (increase_angle link4 angle180 angle190)
   deleted: (hasangle angle180 link4)
   added: (hasangle angle190 link4)
   goals met: 4 of 4
